//-------------------------- DEPENDÊNCIAS ----------------------------------//

#pragma once
#include <Arduino.h>

namespace ARDUINO_CONEXAO {

// ============================================================
//                      ENDEREÇOS I2C
// ============================================================

// SDA 20/ SCL 21 Due são compartilhados entre os dispositivos I2C.

enum class I2C_ENDERECO : uint8_t
{
 //   RTC_DS3231      =  0x68, //conferir se é realmente esse endereço
 //   EEPROM_AT24C32  =  0x52, //conferir se é realmente esse endereço
 //   FRAM_MB85RC256V =  0x50, //conferir se é realmente esse enndereço
};


// ============================================================
// SPI
// ============================================================

enum class SPI : uint8_t
{
    SCK             = 76,
    MOSI            = 75,
    MISO            = 74,
};


// ============================================================
// TFT
// ============================================================

enum class TFT_DISPLAY
{
    CS_TFT_DISPLAY        = 10,
    DC_TFT_DISPLAY        = 6,
    RESET_TFT_DISPLAY     = 7
};


// ============================================================
// SD CARD
// ============================================================

enum class SD_CARD : uint8_t
{
    CS_SD_CARD      = 4
};

//===========================================================
//                   LoRa
//===========================================================

 enum class LORA : uint8_t
  {
        DIO0_LORA                      = 2,
        RESET_LORA                     = 3,
        CS_LORA                        = 5

};

// ============================================================
// DFPLAYER MINI
// ============================================================

enum class DFPLAYER : uint8_t
{
    DF_PLAYER_RX_3 = 15,
    DF_PLAYER_TX_3 = 14
};


// ============================================================
// ESP12-E
// ============================================================

enum class ESP12_E_WI_FI : uint8_t
{
    ESP12_E_RX_1 = 19,
    ESP12_E_TX_1 = 18,

    ESP12_E_ENABLE = 12
};


// ============================================================
// ESP32-S3
// ============================================================

enum class ESP32_S3 : uint8_t
{
    ESP32_S3_RX_2 = 17,
    ESP32_S3_TX_2 = 16,

    ESP32_S3_ENABLE = 15
};

// ============================================================
// BOTÕES
// ============================================================

enum class BOTAO : uint8_t
{
    CIMA_BAIXO  = 8,
    CONFIRMA    = 9
};

}

//====================================================================================
//                   CHAMADAS DOS PINOS NO SISTEMA TODO
//====================================================================================

template<typename T>
constexpr uint8_t pino(T v) {
    return static_cast<uint8_t>(v);
}

